import os
from config import Config

class Script(object):
    START_TXT = """<b>היי {}

אני בוט מתקדם להעברות
אני יכול להעביר את כל ההודעות מערוץ אחד לערוץ אחר</b>

**לְחַץ על כפתור העזרה כדי לדעת עוד עליי**"""
    
    HELP_TXT = """<b><u>🔆 עזרה</b></u>

<u>**📚 פקודות זמינות:**</u>
<b>⏣ __/start - בדוק שאני חי__ 
⏣ __/forward - להעביר הודעות__
⏣ __/settings - הגדר את ההגדרות שלך__
⏣ __ /unequify - מחק הודעות מדיה כפולות בצ'טים__
⏣ __ /stop - עצור את המשימות הפעילות שלך__
⏣ __ /reset - אפס את ההגדרות שלך__</b>

<b><u>💢 תכונות:</b></u>
<b>► __העבר הודעה מערוץ ציבורי לערוץ שלך ללא אישור מנהל. אם הערוץ פרטי, יש צורך באישור מנהל. אם אינך יכול לתת אישור מנהל, השתמש ב-userbot, אך ב-userbot יש סיכון שהחשבון שלך ייחסם, לכן השתמש בחשבון פיקטיבי__
► __כותרת מותאמת__
► __לחצן מותאם__
► __דלג על הודעות כפולות__
► __סנן סוגי הודעות__</b>
"""
    
    HOW_USE_TXT = """<b><u>⚠️ לפני העברה:</b></u>
<b>► __הוסף בוט או userbot__
► __הוסף לפחות אחד לערוץ__ `(הבוט/ה-userbot שלך חייב להיות מנהל שם)`
► __אתה יכול להוסיף צ'טים או בוטים באמצעות /settings__
► __אם ה-**ערוץ מקור** הוא פרטי, ה-userbot שלך חייב להיות חבר שם או שהבוט שלך צריך אישור מנהל גם שם__
► __אז השתמש ב-/forward כדי להעביר הודעות__

► ʜᴏᴡ ᴛᴏ ᴜsᴇ ᴍᴇ [ᴛᴜᴛᴏʀɪᴀʟ ᴠɪᴅᴇᴏ](https://youtu.be/wO1FE-lf35I)</b>"""
    
    ABOUT_TXT = """<b>╔════❰ ғᴏʀᴡᴀʀᴅ ʙᴏᴛ ❱═❍⊱❁۪۪
║╭━━━━━━━━━━━━━━━➣
║┣⪼📃ʙᴏᴛ : </b><a href="https://t.me/The_Auto_Forward_RoBot"><b>Fᴏʀᴡᴀᴅ Bᴏᴛ</b></a><b>
║┣⪼👦Cʀᴇᴀᴛᴏʀ : </b><a href="https://t.me/The_Joker121"><b>𝑻𝒉𝒆 𝑱𝒐𝒌𝒆𝒓🃏</b></a><b>
║┣⪼🤖Uᴘᴅᴀᴛᴇ : </b><a href="https://t.me/bot_sratim_sdarot"><b>בוטים 🇮🇱</b></a><b>
║┣⪼📡Hᴏsᴛᴇᴅ ᴏɴ : Sᴜᴘᴇʀ Fᴀsᴛ
║┣⪼🗣️Lᴀɴɢᴜᴀɢᴇ : Pʏᴛʜᴏɴ3
║┣⪼📚Lɪʙʀᴀʀʏ : Pʏʀᴏɢʀᴀᴍ Gᴀᴛʜᴇʀ 2.11.0 
║┣⪼🗒️Vᴇʀsɪᴏɴ : 0.18.3
║╰━━━━━━━━━━━━━━━➣
╚══════════════════❍⊱❁۪۪</b>"""
    
    STATUS_TXT = """
╔════❰ ʙᴏᴛ sᴛᴀᴛᴜs  ❱═❍⊱❁۪۪
║╭━━━━━━━━━━━━━━━➣
║┣⪼**⏳ ʙᴏᴛ ᴜᴘᴛɪᴍᴇ:**`{}`
║┃
║┣⪼**👱 Tᴏᴛᴀʟ Usᴇʀs:** `{}`
║┃
║┣⪼**🤖 Tᴏᴛᴀʟ Bᴏᴛ:** `{}`
║┃
║┣⪼**🔃 Fᴏʀᴡᴀʀᴅɪɴɢs:** `{}`
║┃
║╰━━━━━━━━━━━━━━━➣
╚══════════════════❍⊱❁۪۪
"""
    
    FROM_MSG = "<b>❪ הגדר צ'אט מקור ❫\n\nהעבר את ההודעה האחרונה או את הקישור להודעה האחרונה של צ'אט המקור.\n/cancel - ביטול תהליך זה</b>"
    TO_MSG = "<b>❪ בחר צ'אט יעד ❫\n\nבחר את צ'אט היעד שלך מתוך הכפתורים הנתונים.\n/cancel - ביטול תהליך זה</b>"
    SKIP_MSG = "<b>❪ הגדר מספר דילוג על הודעות ❫</b>\n\n<b>דלג על ההודעות בהתאם למספר שתזין והשאר ההודעות יועברו.\nמספר דילוג ברירת מחדל =</b> <code>0</code>\n<code>דוגמה: אתה מזין 0 = 0 הודעות דולגו\n אתה מזין 5 = 5 הודעות דולגו</code>\n/cancel <b>- ביטול תהליך זה</b>"
    CANCEL = "<b>התהליך בוטל בהצלחה!</b>"
    BOT_DETAILS = "<b><u>📄 פרטי בוט</b></u>\n\n<b>➣ שם:</b> <code>{}</code>\n<b>➣ מזהה בוט:</b> <code>{}</code>\n<b>➣ שם משתמש:</b> @{}"
    USER_DETAILS = "<b><u>📄 פרטי משתמש בוט</b></u>\n\n<b>➣ שם:</b> <code>{}</code>\n<b>➣ מזהה משתמש:</b> <code>{}</code>\n<b>➣ שם משתמש:</b> @{}"  
    
    
    
    DOUBLE_CHECK = """<b><u>בדיקה כפולה ⚠️</b></u>
<code>לפני העברת ההודעות לחץ על כפתור 'כן' רק לאחר בדיקה של הדברים הבאים</code>

<b>★ הבוט שלך:</b> [{botname}](t.me/{botuname})
<b>★ מהערוץ:</b> `{from_chat}`
<b>★ לערוץ:</b> `{to_chat}`
<b>★ דלג על הודעות:</b> `{skip}`

<i>° [{botname}](t.me/{botuname}) חייב להיות מנהל ב**צ'אט יעד**</i> (`{to_chat}`)
<i>° אם ה-**צ'אט מקור** הוא פרטי, ה-userbot שלך חייב להיות חבר שם או שהבוט שלך חייב להיות מנהל גם שם</b></i>

<b>אם הדברים הנ"ל נבדקו, אז ניתן ללחוץ על כפתור 'כן'</b>"""
    
    SETTINGS_TXT = """<b>שנה את ההגדרות שלך כפי שתרצה</b>"""
